<!-- 58 -->
<html><HEAD><TITLE>Test VCA - test numero 58</TITLE><head><body>
<center><h2>Test VCA - test numero 58</h2></center><hr>
<center><h3><b>Domanda 1</b></h3></center>
	<domanda>
		In quale caso non &egrave; soddisfatta l&rsquo;implicazione &not;p &rArr; q: 

<ul>
<li><b>A</b> 		se p &egrave; vero e q &egrave; vero 
</li>
<li><b>B</b> 		se p &egrave; vero e q &egrave; falso 
</li>
<li><b>C</b> 		se p &egrave; falso e q &egrave; falso 
</li>
<li><b>D</b> 		se p &egrave; falso e q &egrave; vero 
</li>
</ul>
<center><h3><b>Domanda 2</b></h3></center>
	<domanda>
		Si consideri un&rsquo;architettura di comunicazione protocollare a strati (layered); In un sistema terminale (es. un PC connesso in rete) il flusso informativo di dati attraversa gli strati protocollari:

<ul>
<li><b>A</b> 		in senso gerarchico decrescente se il terminale &egrave; di origine
</li>
<li><b>B</b> 		sempre in senso gerarchico crescente
</li>
<li><b>C</b> 		sempre in senso gerarchico decrescente 
</li>
<li><b>D</b> 		senza seguire un particolare ordine gerarchico
</li>
</ul>
<center><h3><b>Domanda 3</b></h3></center>
	<domanda>
Si consideri il seguente metodo Java:
<pre>
public static void cosaFa(int[] v, short y) {
	int i = 0;
	while (i&lt;v.length) v[++i] = y;
}
</pre>
Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> 		Il metodo scrive il valore <tt>y</tt> in tutte le celle dell&#x27;array <tt>v</tt>.
</li>
<li><b>B</b> 		Il metodo genera una eccezione di tipo <tt>ArrayIndexOutOfBoundsException</tt>.
</li>
<li><b>C</b> 		Il metodo genera un errore di compilazione perch&egrave; <tt>length</tt> andrebbe scritto <tt>lenght</tt>
</li>
<li><b>D</b> 		Il metodo genera una eccezione di tipo <tt>PossibleLossOfPrecision</tt> poich&egrave; non &egrave; possibile assegnare uno <tt>short</tt> a una variabile <tt>int</tt>.
</li>
</ul>
<center><h3><b>Domanda 4</b></h3></center>
		Qual'&egrave; il tempo tipico di accesso (latenza) a una memoria DRAM?

<ul>
<li><b>A</b> 		10-100 nanosecondi
</li>
<li><b>B</b> 		1-10 nanosecondi
</li>
<li><b>C</b> 		1-10 millisecondi
</li>
<li><b>D</b> 		1-10 microsecondi
</li>
</ul>
<center><h3><b>Domanda 5</b></h3></center>
	<domanda>
		Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> 		Un vincolo di foreign key (chiave esterna) tra un attributo A di una relazione R ed una relazione Q impone che anche la chiave di Q sia un attributo di nome A
</li>
<li><b>B</b> 		Un vincolo di foreign key tra un attributo A di una relazione R ed una relazione Q impone che non esistono due tuple di R con lo stessao valore dell&#x27;attributo A;
</li>
<li><b>C</b> 		Un vincolo di foreign key tra un attributo A di una relazione R ed una relazione Q impone che ogni valore che compare in A compare anche nella chiave primaria di Q;
</li>
<li><b>D</b> 		Un vincolo di foreign key tra un attributo A di una relazione R ed una relazione Q impllica che il valore nullo non pu&ograve; comparire in A.
</li>
</ul>
<center><h3><b>Domanda 6</b></h3></center>
	<domanda>
Si consideri la seguente classe:
<pre>
public class Overloading{
	public void foo(String s) {}
	public void foo(String s, int i) {}
	public String foo(String s) {return s;}
}
</pre>
Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> Il codice compila correttamente.
</li>
<li><b>B</b> Il compilatore da un errore di compilazione poich&egrave; il corpo dei metodi &egrave; vuoto.
</li>
<li><b>C</b> Il compilatore da un errore di compilazione poich&egrave; il primo e l&#x27;ultimo metodo hanno la stessa firma.
</li>
<li><b>D</b> Il compilatore da un errore di compilazione poich&egrave; i metodi hanno lo stesso nome.
</li>
</ul>
<center><h3><b>Domanda 7</b></h3></center>
	<domanda>
Una sola delle seguenti affermazioni &egrave; corretta. Quale?

<ul>
<li><b>A</b> Per definire una classe <tt>C</tt> appartenente al package <tt>p</tt> &egrave; sufficiente scrivere la classe in un file contenente la direttiva <tt>package p</tt>;
</li>
<li><b>B</b> Per definire una classe <tt>C</tt> appartenente al package <tt>p</tt> &egrave; sufficiente creare una directory <tt>p</tt> e scrivere la classe in un file all&#x27;interno della directory <tt>p</tt> contenente la dichiarazione <tt>package p; class C { ... }</tt>;
</li>
<li><b>C</b> Per definire una classe <tt>C</tt> appartenente al package <tt>p</tt> &egrave; sufficiente scrivere la classe in un file contenente la dichiarazione <tt>package p; class C { ... }</tt>
</li>
<li><b>D</b> Per definire una classe <tt>C</tt> appartenente al package <tt>p</tt> &egrave; sufficiente scrivere la classe in un file contenente la dichiarazione <tt>class p.C { ... }</tt>
</li>
</ul>
<center><h3><b>Domanda 8</b></h3></center>
	<domanda>
		Quale tipologia di visita di un albero non &egrave; in profondit&agrave;? 

<ul>
<li><b>A</b> 		In ordine anticipato (pre-order)
</li>
<li><b>B</b> 		In ampiezza
</li>
<li><b>C</b> 		In ordine simmetrico (in-order)
</li>
<li><b>D</b> 		In ordine posticipato (post-order)
</li>
</ul>
<center><h3><b>Domanda 9</b></h3></center>
	<domanda>
		L&#x27;assegnazione degli autovalori consente di	

<ul>
<li><b>A</b> 		controllare la risposta transitoria;
</li>
<li><b>B</b> 		progettare un controllore a dimensione minima;
</li>
<li><b>C</b> 		ricostruire asintoticamente lo stato del processo;
</li>
<li><b>D</b> 		effettuare la reiezione completa dei disturbi.
</li>
</ul>
<center><h3><b>Domanda 10</b></h3></center>
		Quali tra le seguenti istruzioni dichiara e inizializza correttamente un array bidimensionale ? Scegliere una risposta.

<ul>
<li><b>A</b> 		int a[][] = new int[10,10]
</li>
<li><b>B</b> 		int [a][] = new int[10][10];
</li>
<li><b>C</b> 		int a[10][10] = new int[][];
</li>
<li><b>D</b> 		int a[][] = new int[10][10];
</li>
</ul>
</body></html>
