<!-- 22 -->
<html><HEAD><TITLE>Test VCA - test numero 22</TITLE><head><body>
<center><h2>Test VCA - test numero 22</h2></center><hr>
<center><h3><b>Domanda 1</b></h3></center>
	<domanda>
		Quale delle seguenti proposizioni &egrave; errata?

<ul>
<li><b>A</b> 		a &and; b &equiv; &not;(&not;a &or; &not;b)
</li>
<li><b>B</b> 		a &#x27F6; b &equiv; &not;a &or; b
</li>
<li><b>C</b> 		a &#x27F7; b &equiv; &not;a &or; &not;b
</li>
<li><b>D</b> 		a &or; b &equiv; &not;(&not;a &and; &not;b)
</li>
</ul>
<center><h3><b>Domanda 2</b></h3></center>
Si consideri il seguente metodo per il calcolo del fattoriale
<pre>
public static long fattoriale(long n) {
	if (n == 0)
		return 1;
	else
		return n * fattoriale(n-1);
}
</pre>
Solo una delle seguenti affermazioni &egrave; vera. Dire quale.

<ul>
<li><b>A</b> Lo Stack della Java Virtual Machine contiene, ad ogni istante, soltanto un record di attivazione relativo al metodo.
</li>
<li><b>B</b> Il numero di record di attivazione presenti nello stack quando il metodo viene invocato con valore <tt>0</tt> del parametro &egrave; <tt>n+1</tt>.
</li>
<li><b>C</b> Il numero massimo di record di attivazione presenti nello stack a seguito dell&#x27;invocazione del metodo non dipende da <tt>n</tt>.
</li>
<li><b>D</b> Non &egrave; possibile stabilire a priori il numero massimo di record di attivazione che saranno presenti nello stack in seguito all&#x27;invocazione del metodo.
</li>
</ul>
<center><h3><b>Domanda 3</b></h3></center>
	<domanda>
		La nozione di &quot;relazione&quot; &egrave; alla base del modello relazionale dei dati. Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> 		Una relazione nel modello relazionale &egrave; un multiinsieme di tuple.
</li>
<li><b>B</b> 		Una relazione nel modello relazionale &egrave; una tabella che pu&ograve; essere anche infinita;
</li>
<li><b>C</b> 		Una relazione nel modello relazionale &egrave; definita come una relazione matematica, ovvero come un sottoinsieme del prodotto cartesiano di N insiemi di valori, dove N &egrave; il grado della relazione;
</li>
<li><b>D</b> 		Una relazione nel modello relazionale &egrave; definita come una relaziona matematica, ma con la differenza che le tuple che compongono la relazione (dette tuple) sono ordinate;
</li>
</ul>
<center><h3><b>Domanda 4</b></h3></center>
	<domanda>
		Le modulazioni numeriche in banda traslata si utilizzano per multiplare pi&ugrave; segnali numerici sullo stesso canale. 

<ul>
<li><b>A</b> 		A parit&agrave; di banda del canale, meno &egrave; larga l&rsquo;occupazione in banda del segnale, pi&ugrave; &egrave; alto il numero di segnali che possono essere trasmessi contemporaneamente
</li>
<li><b>B</b> 		A parit&agrave; di banda del canale, pi&ugrave; &egrave; larga l&rsquo;occupazione in banda del segnale, pi&ugrave; &egrave; alto il numero di segnali che possono essere trasmessi contemporaneamente
</li>
<li><b>C</b> 		A parit&agrave; di banda del segnale, meno &egrave; larga l&rsquo;occupazione in banda del canale, pi&ugrave; &egrave; alto il numero di segnali che possono essere trasmessi contemporaneamente
</li>
<li><b>D</b> 		Non esiste alcuna dipendenza tra la banda del segnale e il numero di segnali numero di segnali che possono essere trasmessi contemporaneamente
</li>
</ul>
<center><h3><b>Domanda 5</b></h3></center>
	<domanda>
		Quanto dovrebbe essere grande una tabella delle pagine per mappare uno spazio di memoria virtuale di 1 TB su uno spazio di memoria fisico di 4 GB con pagine di 1 KB?

<ul>
<li><b>A</b> 		128 MB
</li>
<li><b>B</b> 		4 GB
</li>
<li><b>C</b> 		512 MB
</li>
<li><b>D</b> 		1 GB
</li>
</ul>
<center><h3><b>Domanda 6</b></h3></center>
	<domanda>
		Quali di queste specifiche pu&ograve; essere in generale soddisfatta in un sistema tempo discreto e non in un sistema tempo continuo?

<ul>
<li><b>A</b> 		errore  nullo a regime permanente corrispondente ad un ingresso a gradino;
</li>
<li><b>B</b> 		errore nullo in tempo finito corrispondente ad un ingresso a gradino;
</li>
<li><b>C</b> 		autovalori del sistema complessivo coincidenti con dei valori assegnati. 
</li>
<li><b>D</b> 		sistema complessivo asintoticamente stabile;
</li>
</ul>
<center><h3><b>Domanda 7</b></h3></center>
	<domanda>
		Una sola delle seguenti affermazioni sul passaggio dei parametri in Java &egrave; vera. Quale? Al momento dell&#x27;invocazione di un metodo:

<ul>
<li><b>A</b> 		in assenza di overloading, i parametri passati non devono eccedere i parametri dell&#x27;intestazione del metodo, ma possono anche essere di pi&ugrave;.
</li>
<li><b>B</b> 		i parametri formali dell&#x27;invocazione vengono copiati nei corrispondenti parametri attuali dell&#x27;intestazione del metodo.
</li>
<li><b>C</b> 		in assenza di overloading, i parametri passati non devono eccedere i parametri dell&#x27;intestazione del metodo, ma possono anche essere di meno.
</li>
<li><b>D</b> 		i parametri attuali dell&#x27;invocazione vengono copiati nei corrispondenti parametri formali dell&#x27;intestazione del metodo.
</li>
</ul>
<center><h3><b>Domanda 8</b></h3></center>
		Il minimo numero di foglie di un albero binario di n nodi &egrave;

<ul>
<li><b>A</b> 		n-1
</li>
<li><b>B</b> 		2<sup>n</sup>
</li>
<li><b>C</b> 		1
</li>
<li><b>D</b> 		&#x23A3;log<sub>2</sub> n&#x23A6;
</li>
</ul>
<center><h3><b>Domanda 9</b></h3></center>
	<domanda>
Si consideri il seguente frammento di programma Java
<pre>
class Nodo {
	public Nodo next;
	public Object elem;
	public Nodo(Object e, Nodo n) {
		elem=e; next=n;
	}
	public String toString() {
		if (next==null) return elem.toString();
		else return elem+" "+this.next;
	} 
}
public class Test {
	public static void main(String[] args) {
		Nodo init = new Nodo("A",new Nodo("B",new Nodo("C",null)));
		System.out.println(init);
	}
}
</pre>
Una sola delle seguenti affermazioni &egrave; corretta. Quale?

<ul>
<li><b>A</b> Il programma &egrave; eseguito correttamente e stampa <tt>A B C</tt>
</li>
<li><b>B</b> Il programma &egrave; eseguito correttamente e stampa <tt>A null</tt>
</li>
<li><b>C</b> Il frammento di codice contiene errori sintattici.
</li>
<li><b>D</b> Il programma &egrave; eseguito correttamente e stampa <tt>A B</tt>
</li>
</ul>
<center><h3><b>Domanda 10</b></h3></center>
	<domanda>
		Si consideri il seguente frammento di codice Java:
<pre>
import java.util.*;
public class Test {
	public static void main(String[] args){
		List&lt;Integer&gt; l = new ArrayList&lt;Integer&gt;();
		l.add(new Integer(1));
		l.add(new Integer(2)); 
		l.add(new Integer(3));
		... // ISTRUZIONE A QUI
		while (i.hasNext()) {
			int q;
			... // ISTRUZIONE B QUI
			System.out.println(q*q);
		}
	}
}
</pre>
Mettendo al posto delle istruzioni mancanti le seguenti istruzioni A e B, una sola tra queste combinazione &egrave; errata e non produce il risultato di stampare i numeri 1, 4, 9. Quale?
Scegliere una risposta.

<ul>
<li><b>A</b> 		A: Iterator&lt;Object&gt; i = l.iterator(); 
		B: q = (Integer)i.next();

</li>
<li><b>B</b> 		A: Iterator&lt;Integer&gt; i = l.iterator(); 
		B: q = (int)i.next();

</li>
<li><b>C</b> 		A: Iterator&lt;Integer&gt; i = l.iterator(); 
		B: q = i.next();

</li>
<li><b>D</b> 		A: Iterator i = l.iterator(); 
		B: q = (Integer)i.next();

</li>
</ul>
</body></html>
