<!-- 86 -->
<html><HEAD><TITLE>Test VCA - test numero 86</TITLE><head><body>
<center><h2>Test VCA - test numero 86</h2></center><hr>
<center><h3><b>Domanda 1</b></h3></center>
	<domanda>
Si consideri il seguente metodo (il cui corpo &egrave; volutamente privo di indentazione):
<pre>
public static int f (int a, int b, int c) {
	if (a>b)
	if (b>c)
	return a;
	else
	return c;
	return b;
}
</pre>
Si assuma che il metodo venga invocato con i seguenti paramentri attuali: <tt>f(10, 5, 7)</tt>. Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> 		L&#x27;<tt>else</tt> fa riferimento al secondo <tt>if</tt>. Il metodo restituisce quindi <tt>7</tt>.
</li>
<li><b>B</b> 		Il metodo causa un errore a tempo di compilazione, perche&#x301; il compilatore non sa a quale <tt>if</tt> riferire l&#x27;<tt>else</tt>.
</li>
<li><b>C</b> 		Il metodo causa un errore a tempo di esecuzione, perche&#x301; la JVM non sa a quale <tt>if</tt> riferire l&#x27;<tt>else</tt>.
</li>
<li><b>D</b> L&#x27;<tt>else</tt> fa riferimento al primo <tt>if</tt>. Il metodo restituisce quindi <tt>5</tt>.
</li>
</ul>
<center><h3><b>Domanda 2</b></h3></center>
	<domanda>
		Dato il sequente programma:
<pre>
public class test {
	public static void main(String args[]) {
		int i=1, 
		j=1; 
		try {
			i++;
			j--;
			if(i/j &gt; 1)
			i++; 
		}
		catch(ArithmeticException e) { 
			System.out.println(0);
		}
		catch(ArrayIndexOutOfBoundsException e) {
			System.out.println(1); 
		}
		catch(Exception e) { 
			System.out.println(2);
		} 
		finally {
			System.out.println(3); 
		}
		System.out.println(4); 
	}
}
</pre>
Quale dei seguenti numeri viene stampato ?
Scegliere una risposta.

<ul>
<li><b>A</b> 		0,4
</li>
<li><b>B</b> 		3,4,5
</li>
<li><b>C</b> 		0,3,4
</li>
<li><b>D</b> 		2,6,6
</li>
</ul>
<center><h3><b>Domanda 3</b></h3></center>
	<domanda>
		In un albero binario completo di n nodi l&#x27;altezza &egrave;

<ul>
<li><b>A</b> 		&#x3F4;(n)
</li>
<li><b>B</b> 		&#x3F4;(1)
</li>
<li><b>C</b> 		&#x3F4;(log n)
</li>
<li><b>D</b> 		&#x3F4;(n log n)
</li>
</ul>
<center><h3><b>Domanda 4</b></h3></center>
	<domanda>
		Una sola delle seguenti affermazioni sul modello Entit&agrave;-Relazione &egrave; vera. Quale?

<ul>
<li><b>A</b> 		Un identificatore si pu&ograve; definire su una relazione solo se tale relazione non &egrave; in relazione ISA con un&#x27;altra.
</li>
<li><b>B</b> 		Gli identificatori si possono definire sia sulle entit&agrave; sia sugli attributi;
</li>
<li><b>C</b> 		Un identificatore di una relazione pu&ograve; comprendere sia i ruoli coinvolti in tale relazione sia gli attributi definiti per tale relazione
</li>
<li><b>D</b> 		Solo sulle entit&agrave; si possono definire gli identificatori;
</li>
</ul>
<center><h3><b>Domanda 5</b></h3></center>
	<domanda>
		Il massimo numero di nodi di un albero binario di altezza h &egrave;

<ul>
<li><b>A</b> 		2<sup>h</sup>
</li>
<li><b>B</b> 		&#x23A3;log<sub>2</sub> h&#x23A6;
</li>
<li><b>C</b> 		2<sup>h+1</sup>-1
</li>
<li><b>D</b> 		2h
</li>
</ul>
<center><h3><b>Domanda 6</b></h3></center>
	<domanda>
Si consideri la seguente espressione booleana:
<tt>!(a || b) && b</tt>
Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> l&#x27;espressione restituisce true solo quando b==true e a==false.
</li>
<li><b>B</b> l&#x27;espressione restituisce sempre true.
</li>
<li><b>C</b> l&#x27;espressione restituisce true solo quando b==true.
</li>
<li><b>D</b> l&#x27;espressione restituisce sempre false.
</li>
</ul>
<center><h3><b>Domanda 7</b></h3></center>
	<domanda>
		La stabilit&agrave; interna di un sistema lineare

<ul>
<li><b>A</b> 		&egrave; una propriet&agrave; delle evoluzioni libere nello stato;
</li>
<li><b>B</b> 		riguarda la limitatezza delle uscite rispetto all&rsquo;ingresso;
</li>
<li><b>C</b> 		dipende dal segno della parte reale dei poli della funzione di trasferimento;
</li>
<li><b>D</b> 		&egrave; assicurata dalla raggiungibilit&agrave; e osservabilit&agrave; del sistema.
</li>
</ul>
<center><h3><b>Domanda 8</b></h3></center>
	<domanda>
		L&rsquo;elemento chiave per evitare il reiterarsi di collisioni in un accesso multiplo (MAC) casuale &egrave;:

<ul>
<li><b>A</b> 		l&rsquo;aggiunta di un campo di rivelazione di errore nelle Unit&agrave; Dati MAC
</li>
<li><b>B</b> 		la casualizzazione della durata dell&rsquo;intervallo di tempo di attesa prima di tentare la nuova emissione (noto come back-off)
</li>
<li><b>C</b> 		la possibilit&agrave; di ascoltare il mezzo multiaccesso per verificare la presenza di trasmissioni in corso prima di iniziare una nuova trasmissione
</li>
<li><b>D</b> 		effettuare un controllo centralizzato delle collisioni 
</li>
</ul>
<center><h3><b>Domanda 9</b></h3></center>
	<domanda>
		Il segmento TEXT/CODE di un processo mantiene:

<ul>
<li><b>A</b> 		I blocchi allocati dinamicamente dal programma
</li>
<li><b>B</b> 		Il codice eseguibile su cui &egrave; basato il processo
</li>
<li><b>C</b> 		Le stringhe contenute nel testo del programma
</li>
<li><b>D</b> 		Le variabili con durata statica (es. variabili globali) di un programma
</li>
</ul>
<center><h3><b>Domanda 10</b></h3></center>
	<domanda>
Si consideri il seguente metodo, assumendo che esso sia invocato con valore del parametro <tt>n > 0</tt>:
<pre>
public static long myfatt(long n) {
	if (n == 0)
		return 1;
	else
		return n * myfatt(n);
}
</pre>
Solo una delle seguenti affermazioni &egrave; vera. Dire quale.

<ul>
<li><b>A</b> Il metodo viene invocato ricorsivamente <tt>11</tt> volte.
</li>
<li><b>B</b> Il metodo non &egrave; ricorsivo, in quanto tutte le invocazioni avvengono con lo stesso valore del parametro di ingresso.
</li>
<li><b>C</b> Non &egrave; possibile stabilire a priori se il metodo determini un&#x27;eccezione o meno, in quanto tale evento dipende dal valore di <tt>n</tt>.
</li>
<li><b>D</b> L&#x27;esecuzione del metodo causa un overflow dello stack della Java Virtual Machine in quanto determina un numero potenzialmente infinito di invocazioni ricorsive.
</li>
</ul>
</body></html>
