<!-- 83 -->
<html><HEAD><TITLE>Test VCA - test numero 83</TITLE><head><body>
<center><h2>Test VCA - test numero 83</h2></center><hr>
<center><h3><b>Domanda 1</b></h3></center>
	<domanda>
		In generale, per progettare un sistema di controllo che permetta la reiezione completa del disturbo &egrave; necessario che:

<ul>
<li><b>A</b> 		il disturbo sia limitato;
</li>
<li><b>B</b> 		il disturbo sia illimitato.
</li>
<li><b>C</b> 		il controllore sia a dimensione minima;
</li>
<li><b>D</b> 		il disturbo sia misurabile;
</li>
</ul>
<center><h3><b>Domanda 2</b></h3></center>
	<domanda>
		Qual &egrave; il costo di cancellazione di una chiave in un albero di ricerca binario (BST)? 

<ul>
<li><b>A</b> 		O(1)
</li>
<li><b>B</b> 		O(log n)
</li>
<li><b>C</b> 		O(n log n)
</li>
<li><b>D</b> 		O(n)
</li>
</ul>
<center><h3><b>Domanda 3</b></h3></center>
	<domanda>
		Quale categoria di grafi semplici (non orientati e privi di self-loop) non ammette una foresta ricoprente?

<ul>
<li><b>A</b> 		Nessuna
</li>
<li><b>B</b> 		Grafi connessi
</li>
<li><b>C</b> 		Grafi non connessi
</li>
<li><b>D</b> 		Grafi aciclici
</li>
</ul>
<center><h3><b>Domanda 4</b></h3></center>
	<domanda>
Si consideri il seguente metodo, assumendo che esso sia invocato con valore del parametro <tt>n > 0</tt>:
<pre>
public static long myfatt(long n) {
	if (n == 0)
		return 1;
	else
		return n * myfatt(n);
}
</pre>
Solo una delle seguenti affermazioni &egrave; vera. Dire quale.

<ul>
<li><b>A</b> L&#x27;esecuzione del metodo causa un overflow dello stack della Java Virtual Machine in quanto determina un numero potenzialmente infinito di invocazioni ricorsive.
</li>
<li><b>B</b> Il metodo non &egrave; ricorsivo, in quanto tutte le invocazioni avvengono con lo stesso valore del parametro di ingresso.
</li>
<li><b>C</b> Il metodo viene invocato ricorsivamente <tt>11</tt> volte.
</li>
<li><b>D</b> Non &egrave; possibile stabilire a priori se il metodo determini un&#x27;eccezione o meno, in quanto tale evento dipende dal valore di <tt>n</tt>.
</li>
</ul>
<center><h3><b>Domanda 5</b></h3></center>
	<domanda>
		Parte del codice eseguibile delle funzioni di un processo &egrave; memorizzato nel segmento:

<ul>
<li><b>A</b> 		STACK
</li>
<li><b>B</b> 		DATA
</li>
<li><b>C</b> 		CODE
</li>
<li><b>D</b> 		HEAP
</li>
</ul>
<center><h3><b>Domanda 6</b></h3></center>
Quali delle seguenti affermazioni relative al ciclo while &egrave; errata?

<ul>
<li><b>A</b> All&#x27;interno del ciclo &egrave; sempre possibile utilizzare le istruzioni break e continue.
</li>
<li><b>B</b> Qualunque sia il codice che definisce il ciclo &egrave; sempre possibile scrivere un ciclo do...while() equivalente.
</li>
<li><b>C</b> Al termine del ciclo la condizione di guardia ha sempre valore false
</li>
<li><b>D</b> Le variabili utilizzate nella condizione di guardia del ciclo possono essere modificate nel corpo del ciclo stesso.
</li>
</ul>
<center><h3><b>Domanda 7</b></h3></center>
	<domanda>
Si consideri il seguente metodo:
<pre>
public static void stampa()	{
	for (int i=1; i<10; i=i+i) {
		if (i==5) break;
		System.out.print (i);
	}
}
</pre>
Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> 		L&#x27;istruzione <tt>break</tt> all&#x27;interno del metodo <tt>stampa()</tt> non viene mai eseguita.
</li>
<li><b>B</b> 		Il metodo stampa <tt>123456789</tt>
</li>
<li><b>C</b> 		Il metodo stampa <tt>124</tt>
</li>
<li><b>D</b> 		Il metodo causa un errore a tempo di compilazione, perche&#x301; non &egrave; possibile dichiarare una variabile nell&#x27;intestazione di un&#x27;istruzione <tt>for</tt>.
</li>
</ul>
<center><h3><b>Domanda 8</b></h3></center>
		Quali tra le seguenti istruzioni dichiara e inizializza correttamente un array bidimensionale ? Scegliere una risposta.

<ul>
<li><b>A</b> 		int a[][] = new int[10,10]
</li>
<li><b>B</b> 		int a[][] = new int[10][10];
</li>
<li><b>C</b> 		int a[10][10] = new int[][];
</li>
<li><b>D</b> 		int [a][] = new int[10][10];
</li>
</ul>
<center><h3><b>Domanda 9</b></h3></center>
	<domanda>
		Una sola delle seguenti affermazioni sul modello Entit&agrave;-Relazione &egrave; vera. Quale?

<ul>
<li><b>A</b> 		Gli identificatori si possono definire sia sulle entit&agrave; sia sugli attributi;
</li>
<li><b>B</b> 		Un identificatore si pu&ograve; definire su una relazione solo se tale relazione non &egrave; in relazione ISA con un&#x27;altra.
</li>
<li><b>C</b> 		Solo sulle entit&agrave; si possono definire gli identificatori;
</li>
<li><b>D</b> 		Un identificatore di una relazione pu&ograve; comprendere sia i ruoli coinvolti in tale relazione sia gli attributi definiti per tale relazione
</li>
</ul>
<center><h3><b>Domanda 10</b></h3></center>
	<domanda>
		Le modulazioni numeriche in banda traslata si utilizzano per multiplare pi&ugrave; segnali numerici sullo stesso canale. 

<ul>
<li><b>A</b> 		Non esiste alcuna dipendenza tra la banda del segnale e il numero di segnali numero di segnali che possono essere trasmessi contemporaneamente
</li>
<li><b>B</b> 		A parit&agrave; di banda del canale, pi&ugrave; &egrave; larga l&rsquo;occupazione in banda del segnale, pi&ugrave; &egrave; alto il numero di segnali che possono essere trasmessi contemporaneamente
</li>
<li><b>C</b> 		A parit&agrave; di banda del canale, meno &egrave; larga l&rsquo;occupazione in banda del segnale, pi&ugrave; &egrave; alto il numero di segnali che possono essere trasmessi contemporaneamente
</li>
<li><b>D</b> 		A parit&agrave; di banda del segnale, meno &egrave; larga l&rsquo;occupazione in banda del canale, pi&ugrave; &egrave; alto il numero di segnali che possono essere trasmessi contemporaneamente
</li>
</ul>
</body></html>
