<!-- 62 -->
<html><HEAD><TITLE>Test VCA - test numero 62</TITLE><head><body>
<center><h2>Test VCA - test numero 62</h2></center><hr>
<center><h3><b>Domanda 1</b></h3></center>
	<domanda>
		Un processo &egrave; stabilizzabile asintoticamente con reazione dall&#x27;uscita

<ul>
<li><b>A</b> 		se e solo se tutti i suoi autovalori irraggiungibili e/o inosservabili sono a parte reale negativa;
</li>
<li><b>B</b> 		se e solo se tutti i suoi autovalori sono a parte reale negativa;
</li>
<li><b>C</b> 		se e solo se tutti i suoi autovalori raggiungibili ed osservabili sono a parte reale negativa;
</li>
<li><b>D</b> 		se e solo se tutti i suoi autovalori sono raggiungibili ed osservabili.
</li>
</ul>
<center><h3><b>Domanda 2</b></h3></center>
	<domanda>
Una sola delle seguenti affermazioni &egrave; corretta. Quale?

<ul>
<li><b>A</b> La direttiva <tt>package auto.utilita;</tt> deve essere la prima dichiarazione di un file Java contenuto in una directory <tt>auto\utilita</tt>.
</li>
<li><b>B</b> La direttiva <tt>package auto.utilita;</tt> pu&ograve; essere presente prima della dichiarazione di una qualsiasi classe in un file Java contenuto in una directory <tt>auto\utilita</tt>.
</li>
<li><b>C</b> La direttiva <tt>package auto.utilita;</tt> pu&ograve; essere presente prima della dichiarazione di una qualsiasi classe in un file Java contenuto in una qualsiasi directory.
</li>
<li><b>D</b> La direttiva <tt>package auto.utilita;</tt> deve essere la prima dichiarazione di un file Java contenuto in una qualsiasi directory.
</li>
</ul>
<center><h3><b>Domanda 3</b></h3></center>
	<domanda>
		Le modulazioni numeriche in banda traslata si utilizzano per multiplare pi&ugrave; segnali numerici sullo stesso canale. 

<ul>
<li><b>A</b> 		A parit&agrave; di banda del canale, pi&ugrave; &egrave; larga l&rsquo;occupazione in banda del segnale, pi&ugrave; &egrave; alto il numero di segnali che possono essere trasmessi contemporaneamente
</li>
<li><b>B</b> 		A parit&agrave; di banda del canale, meno &egrave; larga l&rsquo;occupazione in banda del segnale, pi&ugrave; &egrave; alto il numero di segnali che possono essere trasmessi contemporaneamente
</li>
<li><b>C</b> 		Non esiste alcuna dipendenza tra la banda del segnale e il numero di segnali numero di segnali che possono essere trasmessi contemporaneamente
</li>
<li><b>D</b> 		A parit&agrave; di banda del segnale, meno &egrave; larga l&rsquo;occupazione in banda del canale, pi&ugrave; &egrave; alto il numero di segnali che possono essere trasmessi contemporaneamente
</li>
</ul>
<center><h3><b>Domanda 4</b></h3></center>
	<domanda>
		In un albero binario completo di n nodi l&#x27;altezza &egrave;

<ul>
<li><b>A</b> 		&#x3F4;(log n)
</li>
<li><b>B</b> 		&#x3F4;(n)
</li>
<li><b>C</b> 		&#x3F4;(1)
</li>
<li><b>D</b> 		&#x3F4;(n log n)
</li>
</ul>
<center><h3><b>Domanda 5</b></h3></center>
	<domanda>
		La relazione ISA tra entit&agrave; &egrave; una struttura che si pu&ograve; usare nel modello Entit&agrave;-Relazione. Una sola delle seguenti affermazioni sulla relazione ISA &egrave; corretta. Quale?

<ul>
<li><b>A</b> 		Se tra l&#x27;entit&agrave; E e l&#x27;entit&agrave; F sussiste la relazione ISA, allora ogni istanza di E &egrave; collegata con una relazione con almeno una istanza di F; 
</li>
<li><b>B</b> 		Se tra l&#x27;entit&agrave; E e l&#x27;entit&agrave; F sussiste la relazione ISA, allora ogni istanza di E &egrave; anche istanza di F.  
</li>
<li><b>C</b> 		Se tra l&#x27;entit&agrave; E e l&#x27;entit&agrave; F sussiste la relazione ISA, allora E &egrave; un&#x27;entit&agrave; padre in una generalizzazione;
</li>
<li><b>D</b> 		Se tra l&#x27;entit&agrave; E e l&#x27;entit&agrave; F sussiste la relazione ISA, allora E ed F non hanno istanze comuni;
</li>
</ul>
<center><h3><b>Domanda 6</b></h3></center>
	<domanda>
		Si consideri il seguente frammento di codice Java:
<pre>
import java.util.*;
public class Test {
	public static void main(String[] args){
		List&lt;Integer&gt; l = new ArrayList&lt;Integer&gt;();
		l.add(new Integer(1));
		l.add(new Integer(2)); 
		l.add(new Integer(3));
		... // ISTRUZIONE A QUI
		while (i.hasNext()) {
			int q;
			... // ISTRUZIONE B QUI
			System.out.println(q*q);
		}
	}
}
</pre>
Mettendo al posto delle istruzioni mancanti le seguenti istruzioni A e B, una sola tra queste combinazione &egrave; errata e non produce il risultato di stampare i numeri 1, 4, 9. Quale?
Scegliere una risposta.

<ul>
<li><b>A</b> 		A: Iterator&lt;Object&gt; i = l.iterator(); 
		B: q = (Integer)i.next();

</li>
<li><b>B</b> 		A: Iterator&lt;Integer&gt; i = l.iterator(); 
		B: q = (int)i.next();

</li>
<li><b>C</b> 		A: Iterator i = l.iterator(); 
		B: q = (Integer)i.next();

</li>
<li><b>D</b> 		A: Iterator&lt;Integer&gt; i = l.iterator(); 
		B: q = i.next();

</li>
</ul>
<center><h3><b>Domanda 7</b></h3></center>
	<domanda>
Si consideri il seguente frammento di programma Java
<pre>
class Nodo {
	public Nodo next;
	public Object elem;
	public Nodo(Object e, Nodo n) {
		elem=e; next=n;
	}
	public String toString() {
		if (next==null) return elem.toString();
		else return elem+" "+this.next;
	} 
}
public class Test {
	public static void main(String[] args) {
		Nodo init = new Nodo("A",new Nodo("B",new Nodo("C",null)));
		System.out.println(init);
	}
}
</pre>
Una sola delle seguenti affermazioni &egrave; corretta. Quale?

<ul>
<li><b>A</b> Il frammento di codice contiene errori sintattici.
</li>
<li><b>B</b> Il programma &egrave; eseguito correttamente e stampa <tt>A B C</tt>
</li>
<li><b>C</b> Il programma &egrave; eseguito correttamente e stampa <tt>A null</tt>
</li>
<li><b>D</b> Il programma &egrave; eseguito correttamente e stampa <tt>A B</tt>
</li>
</ul>
<center><h3><b>Domanda 8</b></h3></center>
	<domanda>
		Si consideri un sistema con una piccola cache completamente associativa contenente 2 sole
linee da 16 byte ciascuna. Si consideri il seguente frammento di
programma: 
<pre>
int v[12];
v[0]=5;
v[1]=4;
v[10]=3;
v[8]=2;
v[2]=v[10];
v[9]=v[1];
</pre>
Il programma esibisce qualche tipo di localit&agrave;?

<ul>
<li><b>A</b> 		S&igrave;, solo spaziale
</li>
<li><b>B</b> 		S&igrave;, sia spaziale che temporale
</li>
<li><b>C</b> 		No
</li>
<li><b>D</b> 		S&igrave;, solo temporale
</li>
</ul>
<center><h3><b>Domanda 9</b></h3></center>
	<domanda>
Si consideri il seguente metodo (il cui corpo &egrave; volutamente privo di indentazione):
<pre>
public static int f (int a, int b, int c) {
	if (a>b)
	if (b>c)
	return a;
	else
	return c;
	return b;
}
</pre>
Si assuma che il metodo venga invocato con i seguenti paramentri attuali: <tt>f(10, 5, 7)</tt>. Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> L&#x27;<tt>else</tt> fa riferimento al primo <tt>if</tt>. Il metodo restituisce quindi <tt>5</tt>.
</li>
<li><b>B</b> 		Il metodo causa un errore a tempo di compilazione, perche&#x301; il compilatore non sa a quale <tt>if</tt> riferire l&#x27;<tt>else</tt>.
</li>
<li><b>C</b> 		L&#x27;<tt>else</tt> fa riferimento al secondo <tt>if</tt>. Il metodo restituisce quindi <tt>7</tt>.
</li>
<li><b>D</b> 		Il metodo causa un errore a tempo di esecuzione, perche&#x301; la JVM non sa a quale <tt>if</tt> riferire l&#x27;<tt>else</tt>.
</li>
</ul>
<center><h3><b>Domanda 10</b></h3></center>
		A quale fra le seguenti categorie appartiene un grafo con n &gt; 1 nodi e m = 0 archi?

<ul>
<li><b>A</b> 		Grafo completo
</li>
<li><b>B</b> 		Grafo connesso
</li>
<li><b>C</b> 		DAG
</li>
<li><b>D</b> 		Grafo fortemente connesso
</li>
</ul>
</body></html>
