<!-- 50 -->
<html><HEAD><TITLE>Test VCA - test numero 50</TITLE><head><body>
<center><h2>Test VCA - test numero 50</h2></center><hr>
<center><h3><b>Domanda 1</b></h3></center>
	<domanda>
		A cosa servono le procedure di controllo d&rsquo;errore effettuate in strati protocollari quali quello di collegamento o di trasporto (es: Forward Error Correction (FEC) e Automatic Repeat Request ARQ)?

<ul>
<li><b>A</b> 		a verificare la presenza di errori nella unit&agrave; informative ricevute ed eventualmente correggerli
</li>
<li><b>B</b> 		a garantire che le unit&agrave; informative trasmesse non vengano mai scartate dal ricevitore
</li>
<li><b>C</b> 		solo verificare la giusta sequenza delle unit&agrave; informative ricevute
</li>
<li><b>D</b> 		a numerare le unit&agrave; informative tramesse
</li>
</ul>
<center><h3><b>Domanda 2</b></h3></center>
	<domanda>
		Una sola delle seguenti affermazioni sul modello Entit&agrave;-Relazione &egrave; vera. Quale?

<ul>
<li><b>A</b> 		La relazione ISA tra relazioni non &egrave; transitiva;
</li>
<li><b>B</b> 		La relazione ISA si pu&ograve; definire tra due relazioni, ma solo se tali relazioni hanno gli stessi ruoli;
</li>
<li><b>C</b> 		La relazione ISA si pu&ograve; definire sulle entit&agrave;, ma non sulle relazioni;
</li>
<li><b>D</b> 		La relazione ISA si pu&ograve; definire tra due relazioni, ma solo se tali relazioni hanno gli stessi attributi.
</li>
</ul>
<center><h3><b>Domanda 3</b></h3></center>
	<domanda>
		La stabilit&agrave; interna di un sistema lineare

<ul>
<li><b>A</b> 		&egrave; una propriet&agrave; delle evoluzioni libere nello stato;
</li>
<li><b>B</b> 		riguarda la limitatezza delle uscite rispetto all&rsquo;ingresso;
</li>
<li><b>C</b> 		&egrave; assicurata dalla raggiungibilit&agrave; e osservabilit&agrave; del sistema.
</li>
<li><b>D</b> 		dipende dal segno della parte reale dei poli della funzione di trasferimento;
</li>
</ul>
<center><h3><b>Domanda 4</b></h3></center>
	<domanda>
		Dato il seguente programma:
<pre>
import java.util.*; 
class Test {
	public static void main (String args[]) {
		Object a = new HashSet();
		System.out.print((a instanceof Set)+&quot;,&quot;);
		System.out.print(a instanceof SortedSet);
	}
}
</pre>
Qual&#x27;&egrave; il risultato della compilazione ed esecuzione del programma ?
Scegliere una risposta.

<ul>
<li><b>A</b> 		Stampa:false,false
</li>
<li><b>B</b> 		Stampa:true,true
</li>
<li><b>C</b> 		Stampa:true,false
</li>
<li><b>D</b> 		Stampa:false,true
</li>
</ul>
<center><h3><b>Domanda 5</b></h3></center>
	<domanda>
Si consideri il seguente frammento di codice:
<pre>
public static void  main(String[] args) {
	String[] array=new String[10];
	int i=0;
	while(i<10){
		if(i%2==0){
			array[i]="ok";
			continue;
		}
		i++;
	}
	int cont=0;
	for(i=0;i<10;i++)
		if(array[i].equals("ok"))
			cont++;
	System.out.println(cont);
}
</pre>
Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> L&#x27;esecuzione del metodo non termina.
</li>
<li><b>B</b> Il metodo stampa <tt>5</tt>.
</li>
<li><b>C</b> Il metodo stampa <tt>4</tt>.
</li>
<li><b>D</b> Il metodo genera una eccezione di tipo <tt>NullPointerException</tt>.
</li>
</ul>
<center><h3><b>Domanda 6</b></h3></center>
	<domanda>
Si consideri la classe <tt>ProvaCiclo</tt>, riportata di seguito:
<pre>
import javax.swing.JOptionPane;
public class ProvaCiclo {
	public static void main (String[] args) {
		int i=Integer.parseInt (JOptionPane.showInputDialog ("Immetti un intero positivo"));
		while (i>0) {
			System.out.println (i);
			i--;
		}
	} 
}
</pre>
Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> 		Il metodo <tt>main</tt> contiene un esempio di ciclo definito.
</li>
<li><b>B</b> 		Se il numero immesso dall&#x27;utente &egrave; un intero positivo, vengono stampati gli interi da 1 ad i in ordine crescente.
</li>
<li><b>C</b> 		La classe <tt>ProvaCiclo</tt> causa un errore a tempo di compilazione, perche&#x301; non &egrave; possibile stabilire prima dell&#x27;esecuzione quante iterazioni verranno eseguite all&#x27;interno del metodo main.
</li>
<li><b>D</b> 		Il metodo <tt>main</tt> contiene un esempio di ciclo indefinito.
</li>
</ul>
<center><h3><b>Domanda 7</b></h3></center>
	<domanda>
		In quale caso non &egrave; soddisfatta l&rsquo;implicazione &not;p &rArr; q: 

<ul>
<li><b>A</b> 		se p &egrave; falso e q &egrave; falso 
</li>
<li><b>B</b> 		se p &egrave; vero e q &egrave; vero 
</li>
<li><b>C</b> 		se p &egrave; falso e q &egrave; vero 
</li>
<li><b>D</b> 		se p &egrave; vero e q &egrave; falso 
</li>
</ul>
<center><h3><b>Domanda 8</b></h3></center>
	<domanda>
		Una sola delle seguenti affermazioni &egrave; vera. Quale? Il tempo di vita di una variabile di istanza coincide con il tempo di vita:

<ul>
<li><b>A</b> 		della classe a cui appartiene.
</li>
<li><b>B</b> 		del metodo che per primo la accede.
</li>
<li><b>C</b> 		del programma in cui viene usata.
</li>
<li><b>D</b> 		dell&#x27;oggetto a cui appartiene.
</li>
</ul>
<center><h3><b>Domanda 9</b></h3></center>
	<domanda>
		Quale categoria di grafi semplici (non orientati e privi di self-loop) non ammette una foresta ricoprente?

<ul>
<li><b>A</b> 		Nessuna
</li>
<li><b>B</b> 		Grafi aciclici
</li>
<li><b>C</b> 		Grafi non connessi
</li>
<li><b>D</b> 		Grafi connessi
</li>
</ul>
<center><h3><b>Domanda 10</b></h3></center>
	<domanda>
		Il segmento TEXT/CODE di un processo mantiene:

<ul>
<li><b>A</b> 		Le variabili con durata statica (es. variabili globali) di un programma
</li>
<li><b>B</b> 		Le stringhe contenute nel testo del programma
</li>
<li><b>C</b> 		Il codice eseguibile su cui &egrave; basato il processo
</li>
<li><b>D</b> 		I blocchi allocati dinamicamente dal programma
</li>
</ul>
</body></html>
