<!-- 28 -->
<html><HEAD><TITLE>Test VCA - test numero 28</TITLE><head><body>
<center><h2>Test VCA - test numero 28</h2></center><hr>
<center><h3><b>Domanda 1</b></h3></center>
	<domanda>
		Si consideri un processo con due autovalori in +1 e -1; quello in +1 &egrave; raggiungibile ed osservabile, mentre quello in -1 &egrave; irraggiungibile ed osservabile. Quali di queste affermazioni &egrave; corretta?

<ul>
<li><b>A</b> 		il processo &egrave; stabile asintoticamente;
</li>
<li><b>B</b> 		il processo &egrave; instabile e non &egrave; stabilizzabile asintoticamente;
</li>
<li><b>C</b> 		con un opportuno controllore sar&agrave; possibile controllare completamente il transitorio.
</li>
<li><b>D</b> 		il processo &egrave; instabile, ma &egrave; stabilizzabile asintoticamente;
</li>
</ul>
<center><h3><b>Domanda 2</b></h3></center>
	<domanda>
		Nell&rsquo; indirizzamento in Internet la maschera di sotto-rete:

<ul>
<li><b>A</b> 		distingue tra indirizzi in forma binaria e in rappresentazione decimale
</li>
<li><b>B</b> 		distingue tra indirizzi in forma decimale e in rappresentazione mediante nomi (es: www.uniroma1.it)
</li>
<li><b>C</b> 		distingue tra indirizzi in forma binaria e in rappresentazione mediante nomi (es: www.uniroma1.it)
</li>
<li><b>D</b> 		serve a rendere noto ad ogni sistema in che modo il l&rsquo;indirizzo IP &egrave; suddiviso in modo gerarchico tra parte Net-ID e parte Host-ID
</li>
</ul>
<center><h3><b>Domanda 3</b></h3></center>
	<domanda>
		Quale delle seguenti asserzioni su un grafo semplice &egrave; <b>falsa</b>? (n = num. vertici, m = num. archi)

<ul>
<li><b>A</b> 		m &isin; O(n<sup>2</sup>)
</li>
<li><b>B</b> 		La somma dei gradi dei vertici &egrave; 2m
</li>
<li><b>C</b> 		Il grado di un vertice pu&ograve; essere un qualunque numero in {0, 1, 2, &hellip;, n-1}
</li>
<li><b>D</b> 		&Egrave; certamente connesso
</li>
</ul>
<center><h3><b>Domanda 4</b></h3></center>
	<domanda>
		La nozione di &quot;ruolo&quot; &egrave; una delle nozioni fondamentali del modello Entit&agrave;-Relazione. Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> 		&quot;Ruolo&quot; &egrave; sinonimo di attributo;
</li>
<li><b>B</b> 		&quot;Ruolo&quot; &egrave; sinonimo di relazione;
</li>
<li><b>C</b> 		Un ruolo identifica una partecipazione di una entit&agrave; ad una relazione;
</li>
<li><b>D</b> 		Un ruolo identifica una partecipazione di una entit&agrave; alla relazione ISA.
</li>
</ul>
<center><h3><b>Domanda 5</b></h3></center>
		Qual'&egrave; il tempo tipico di accesso (latenza) a una memoria DRAM?

<ul>
<li><b>A</b> 		10-100 nanosecondi
</li>
<li><b>B</b> 		1-10 millisecondi
</li>
<li><b>C</b> 		1-10 microsecondi
</li>
<li><b>D</b> 		1-10 nanosecondi
</li>
</ul>
<center><h3><b>Domanda 6</b></h3></center>
	<domanda>
		Il problema di trasporre una matrice quadrata ha costo computazionale (nella dimensione dell&#x27;input)

<ul>
<li><b>A</b> 		costante
</li>
<li><b>B</b> 		lineare
</li>
<li><b>C</b> 		logaritmico
</li>
<li><b>D</b> 		quadratico
</li>
</ul>
<center><h3><b>Domanda 7</b></h3></center>
	<domanda>
Si consideri la classe Prova cos&igrave; definita:
<pre>
private class Prova{
	public int x;
	public static int y;
}
</pre>
Una solo dei seguenti metodi non &egrave; corretto e non potrebbe apparire nella definizione di <tt>Prova</tt>. Quale?

<ul>
<li><b>A</b> <tt>public void metodoB() {y++;}</tt>
</li>
<li><b>B</b> <tt>public static void metodoD() {y++;}</tt>
</li>
<li><b>C</b> <tt>public void metodoA() {x++;}</tt>
</li>
<li><b>D</b> <tt>public static void metodoC() {x++;}</tt>
</li>
</ul>
<center><h3><b>Domanda 8</b></h3></center>
	<domanda>
		Si consideri il seguente frammento di codice:
<pre>
String var1=&quot;var1&quot;;    
if(var1!=null){
	String var2=&quot;copia di &quot;+var1;
}    
System.out.println(var2);
</pre>
Assumendo che le uniche variabili sono quelle nel frammento di codice, una sola delle seguenti affermazioni &egrave; vera. Quale?
Scegliere una risposta.

<ul>
<li><b>A</b> 		Il programma stampa copia di var1.
</li>
<li><b>B</b> 		Il programma da un errore a tempo di esecuzione.
</li>
<li><b>C</b> 		Il programma stampa  var1.
</li>
<li><b>D</b> 		Il programma da un errore a tempo di compilazione
</li>
</ul>
<center><h3><b>Domanda 9</b></h3></center>
	<domanda>
Si consideri il seguente frammento di codice:
<pre>
public static void  main(String[] args) {
	String[] array=new String[10];
	int i=0;
	while(i<10){
		if(i%2==0){
			array[i]="ok";
			continue;
		}
		i++;
	}
	int cont=0;
	for(i=0;i<10;i++)
		if(array[i].equals("ok"))
			cont++;
	System.out.println(cont);
}
</pre>
Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> Il metodo genera una eccezione di tipo <tt>NullPointerException</tt>.
</li>
<li><b>B</b> L&#x27;esecuzione del metodo non termina.
</li>
<li><b>C</b> Il metodo stampa <tt>5</tt>.
</li>
<li><b>D</b> Il metodo stampa <tt>4</tt>.
</li>
</ul>
<center><h3><b>Domanda 10</b></h3></center>
	<domanda>
Una sola delle seguenti affermazioni &egrave; corretta. Quale?

<ul>
<li><b>A</b> La direttiva <tt>package auto.utilita;</tt> pu&ograve; essere presente prima della dichiarazione di una qualsiasi classe in un file Java contenuto in una directory <tt>auto\utilita</tt>.
</li>
<li><b>B</b> La direttiva <tt>package auto.utilita;</tt> deve essere la prima dichiarazione di un file Java contenuto in una directory <tt>auto\utilita</tt>.
</li>
<li><b>C</b> La direttiva <tt>package auto.utilita;</tt> pu&ograve; essere presente prima della dichiarazione di una qualsiasi classe in un file Java contenuto in una qualsiasi directory.
</li>
<li><b>D</b> La direttiva <tt>package auto.utilita;</tt> deve essere la prima dichiarazione di un file Java contenuto in una qualsiasi directory.
</li>
</ul>
</body></html>
