<!-- 8 -->
<html><HEAD><TITLE>Test VCA - test numero 8</TITLE><head><body>
<center><h2>Test VCA - test numero 8</h2></center><hr>
<center><h3><b>Domanda 1</b></h3></center>
	<domanda>
		Si consideri la seguente espressione Java: <tt>a==b</tt>, dove <tt>a</tt> e <tt>b</tt> sono riferimenti ad array di <tt>int</tt>. Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> 		L&#x27;espressione vale <tt>true</tt> se <tt>a</tt> e <tt>b</tt> contengono lo stesso indirizzo, cio&egrave; puntano allo stesso array.
</li>
<li><b>B</b> 		L&#x27;espressione vale <tt>true</tt> se <tt>a</tt> e <tt>b</tt> sono riferimenti a due array che contengono gli stessi interi nello stesso ordine.
</li>
<li><b>C</b> 		L&#x27;espressione vale sempre <tt>false</tt>, indipendentemente dal contenuto di <tt>a</tt> e <tt>b</tt>.
</li>
<li><b>D</b> 		L&#x27;espressione &egrave; errata poiche&#x301; l&#x27;operatore <tt>==</tt> non &egrave; applicabile a riferimenti ad array.
</li>
</ul>
<center><h3><b>Domanda 2</b></h3></center>
	<domanda>
		Dato il sequente programma:
<pre>
public class test {
	public static void main(String args[]) {
		int i=1, 
		j=1; 
		try {
			i++;
			j--;
			if(i/j &gt; 1)
			i++; 
		}
		catch(ArithmeticException e) { 
			System.out.println(0);
		}
		catch(ArrayIndexOutOfBoundsException e) {
			System.out.println(1); 
		}
		catch(Exception e) { 
			System.out.println(2);
		} 
		finally {
			System.out.println(3); 
		}
		System.out.println(4); 
	}
}
</pre>
Quale dei seguenti numeri viene stampato ?
Scegliere una risposta.

<ul>
<li><b>A</b> 		0,4
</li>
<li><b>B</b> 		2,6,6
</li>
<li><b>C</b> 		0,3,4
</li>
<li><b>D</b> 		3,4,5
</li>
</ul>
<center><h3><b>Domanda 3</b></h3></center>
	<domanda>
Si consideri il seguente frammento di programma:
<pre>
public class ClasseConErrore {
	public int k;
	public ClasseConErrore(int x) {
		k=x;
	}
	public ClasseConErrore(int x, int y) {
		k=x*y;
	}
	public void stampa() {
		System.out.println(k);
	}
	public static void main(String[] args) {
		int k=12;
		ClasseConErrore a = new ClasseConErrore();
		ClasseConErrore b = new ClasseConErrore(k);
		ClasseConErrore c = new ClasseConErrore(k,10);
		a.stampa();
		b.stampa();
		c.stampa();
	}
}
</pre>
Il programma contiene un errore che ne impedisce la compilazione. Quale ?

<ul>
<li><b>A</b> La funzione <tt>main</tt> tenta di istanziare un oggetto della classe <tt>ClasseConErrore</tt> usando un costruttore senza argomenti non definito.
</li>
<li><b>B</b> La funzione <tt>main</tt> tenta di accedere alla variabile di istanza <tt>k</tt> senza fare riferimento ad oggetti della classe <tt>ClasseConErrore</tt>.
</li>
<li><b>C</b> La funzione <tt>main</tt> sovrascrive la variabile d&#x27;istanza <tt>k</tt> con una versione locale rendendo cos&igrave; impossibile ai costruttori l&#x27;inizializzazione del suo valore.
</li>
<li><b>D</b> Il metodo <tt>main</tt> non pu&ograve; istanziare oggetti della stessa classe in cui &egrave; definito.
</li>
</ul>
<center><h3><b>Domanda 4</b></h3></center>
	<domanda>
		Quali di queste affermazioni &egrave; vera per un sistema ad anello chiuso ed &egrave; falsa per un sistema ad anello aperto? 

<ul>
<li><b>A</b> 		il processo da controllare pu&ograve; avere una o pi&ugrave; ingressi, e una o pi&ugrave; uscite. 
</li>
<li><b>B</b> 		l&#x27;uscita del processo da controllare &egrave; misurabile ed &egrave; utilizzata dal controllore;
</li>
<li><b>C</b> 		l&#x27;uscita del processo da controllare &egrave; misurabile;
</li>
<li><b>D</b> 		l&#x27;uscita del controllore costituisce l&#x27;ingresso del processo da controllare;
</li>
</ul>
<center><h3><b>Domanda 5</b></h3></center>
	<domanda>
		Nell&rsquo; indirizzamento in Internet la maschera di sotto-rete:

<ul>
<li><b>A</b> 		serve a rendere noto ad ogni sistema in che modo il l&rsquo;indirizzo IP &egrave; suddiviso in modo gerarchico tra parte Net-ID e parte Host-ID
</li>
<li><b>B</b> 		distingue tra indirizzi in forma decimale e in rappresentazione mediante nomi (es: www.uniroma1.it)
</li>
<li><b>C</b> 		distingue tra indirizzi in forma binaria e in rappresentazione decimale
</li>
<li><b>D</b> 		distingue tra indirizzi in forma binaria e in rappresentazione mediante nomi (es: www.uniroma1.it)
</li>
</ul>
<center><h3><b>Domanda 6</b></h3></center>
	<domanda>
		La nozione di &quot;ruolo&quot; &egrave; una delle nozioni fondamentali del modello Entit&agrave;-Relazione. Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> 		&quot;Ruolo&quot; &egrave; sinonimo di attributo;
</li>
<li><b>B</b> 		&quot;Ruolo&quot; &egrave; sinonimo di relazione;
</li>
<li><b>C</b> 		Un ruolo identifica una partecipazione di una entit&agrave; ad una relazione;
</li>
<li><b>D</b> 		Un ruolo identifica una partecipazione di una entit&agrave; alla relazione ISA.
</li>
</ul>
<center><h3><b>Domanda 7</b></h3></center>
	<domanda>
		Quale delle seguenti proposizioni &egrave; errata?

<ul>
<li><b>A</b> 		a &and; b &equiv; &not;(&not;a &or; &not;b)
</li>
<li><b>B</b> 		a &#x27F6; b &equiv; &not;a &or; b
</li>
<li><b>C</b> 		a &#x27F7; b &equiv; &not;a &or; &not;b
</li>
<li><b>D</b> 		a &or; b &equiv; &not;(&not;a &and; &not;b)
</li>
</ul>
<center><h3><b>Domanda 8</b></h3></center>
	<domanda>
		In quale caso non &egrave; soddisfatta l&rsquo;implicazione &not;p &rArr; q: 

<ul>
<li><b>A</b> 		se p &egrave; falso e q &egrave; vero 
</li>
<li><b>B</b> 		se p &egrave; falso e q &egrave; falso 
</li>
<li><b>C</b> 		se p &egrave; vero e q &egrave; vero 
</li>
<li><b>D</b> 		se p &egrave; vero e q &egrave; falso 
</li>
</ul>
<center><h3><b>Domanda 9</b></h3></center>
	<domanda>
		In una gerarchia di memoria, le latenze di accesso ai dati sono tali che:

<ul>
<li><b>A</b> 		Registri &lt; L3 &lt; L2 &lt; L1 &lt; memoria centrale &lt; disco
</li>
<li><b>B</b> 		L1 &gt; L2 &gt; L3 &gt; registri &lt; memoria centrale &lt; disco
</li>
<li><b>C</b> 		Registri &lt; L1 &lt; L2 &lt; L3 &lt; memoria centrale &lt; disco
</li>
<li><b>D</b> 		L3 &lt; L2 &lt; L1 &lt; registri &lt; memoria centrale &lt; disco
</li>
</ul>
<center><h3><b>Domanda 10</b></h3></center>
	<domanda>
Si consideri la classe <tt>ProvaSwitch</tt>, riportata di seguito:
<pre>
public class ProvaSwitch {
	public static void conv(int x) {
		switch (x) {
			case 0:
				System.out.print ("Zero");
			case 1:
				System.out.print ("Uno");
				break;
			default:
				System.out.println ("Errore");
		} 
	}
	public static void main (String[] x) {
		for (int i=0; i<=2; i++)
			conv (i);
	}
}
</pre>
Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> 		L'esecuzione del metodo <tt>main</tt> causa la stampa di <tt>ZeroUnoErrore</tt>
</li>
<li><b>B</b> 		L'esecuzione del metodo <tt>main</tt> causa la stampa di <tt>ZeroUnoUnoErrore</tt>
</li>
<li><b>C</b> 		L'esecuzione del metodo <tt>main</tt> causa la stampa di <tt>ZeroUnoDue</tt>
</li>
<li><b>D</b> 		L'esecuzione del metodo <tt>main</tt> causa la stampa di <tt>ZeroUno</tt>
</li>
</ul>
</body></html>
