<!-- 37 -->
<html><HEAD><TITLE>Test VCA - test numero 37</TITLE><head><body>
<center><h2>Test VCA - test numero 37</h2></center><hr>
<center><h3><b>Domanda 1</b></h3></center>
	<domanda>
Si consideri il seguente metodo Java:
<pre>
public static void cosaFa(int[] v, short y) {
	int i = 0;
	while (i&lt;v.length) v[++i] = y;
}
</pre>
Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> 		Il metodo scrive il valore <tt>y</tt> in tutte le celle dell&#x27;array <tt>v</tt>.
</li>
<li><b>B</b> 		Il metodo genera un errore di compilazione perch&egrave; <tt>length</tt> andrebbe scritto <tt>lenght</tt>
</li>
<li><b>C</b> 		Il metodo genera una eccezione di tipo <tt>ArrayIndexOutOfBoundsException</tt>.
</li>
<li><b>D</b> 		Il metodo genera una eccezione di tipo <tt>PossibleLossOfPrecision</tt> poich&egrave; non &egrave; possibile assegnare uno <tt>short</tt> a una variabile <tt>int</tt>.
</li>
</ul>
<center><h3><b>Domanda 2</b></h3></center>
	<domanda>
		Si consideri il seguente frammento di codice Java:
<pre>
public interface I {
	public void f();
}
public interface J {
	public void g();
}
public class C implements I,J {
	public void f() { }
	public void g() { }
}
</pre>
Sia p una variabile di tipo I che contiene l&#x27;indirizzo di un oggetto di tipo C e q una variabile di tipo J. Una sola delle seguenti affermazioni &egrave; corretta: quale?
Scegliere una risposta.

<ul>
<li><b>A</b> 		L&#x27;istruzione q = p; &egrave; corretta.
</li>
<li><b>B</b> 		L&#x27;istruzione q = p; genera un errore di compilazione.
</li>
<li><b>C</b> 		Il frammento di codice contiene errori sintattici.
</li>
<li><b>D</b> 		L&#x27;istruzione q = p; genera un errore di esecuzione.	
</li>
</ul>
<center><h3><b>Domanda 3</b></h3></center>
	<domanda>
		Una sola delle seguenti affermazioni sulla memoria virtuale &egrave; <b>falsa</b>. Quale?

<ul>
<li><b>A</b> 		Separando lo spazio virtuale da quello fisico, si pu&ograve; fare in modo che un processo usi pi&ugrave; memoria di quella disponibile mappando pagine su disco invece che in RAM
</li>
<li><b>B</b> 		Essendo basato su pagine tutte della stessa dimensione, consente di portare a zero il livello di frammentazione interna della memoria
</li>
<li><b>C</b> 		Consentendo di mappare pagine di indirizzi virtuali di processi distinti sullo stesso frame fisico, la memoria virtuale consente la comunicazione e la cooperazione tra processi diversi
</li>
<li><b>D</b> 		Tenendo distinti gli spazi virtuali (logici) di processi diversi, si impedisce che un processo possa interferire con le attivit&agrave; dell&rsquo;altro in modo errato o malizioso, realizzando un meccanismo di protezione
</li>
</ul>
<center><h3><b>Domanda 4</b></h3></center>
	<domanda>
		Si consideri uno schema Entit&agrave;-Relazione in cui l&#x27;entit&agrave; STUDENTE ha l&#x27;attributo MATRICOLA ed &egrave; legata all&#x27;entit&agrave; UNIVERSIT&Agrave; dalla relazione ISCRITTO. Si vuole esprimere nello schema il vincolo che non esistono due studenti iscritti alla stessa universit&agrave; che hanno la stessa matricola. Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> 		Si pu&ograve; esprimere il vincolo definendo l&#x27;attributo MATRICOLA un identificatore per STUDENTE;
</li>
<li><b>B</b> 		Poich&eacute; non &egrave; possibile esprimere il vincolo usando le primitive del modello Entit&agrave;-Relazione, si deve ricorrere ad un vincolo esterno;
</li>
<li><b>C</b> 		Si pu&ograve; esprimere il vincolo definendo l&#x27;attributo MATRICOLA ed il ruolo STUDENTE nella relazione ISCRITTO come un identificatore esterno per STUDENTE;
</li>
<li><b>D</b> 		Il vincolo &egrave; gi&agrave; implicitamente espresso nello schema descritto.
</li>
</ul>
<center><h3><b>Domanda 5</b></h3></center>
	<domanda>
Si consideri il seguente metodo, assumendo che esso sia invocato con valore del parametro <tt>n > 0</tt>:
<pre>
public static long myfatt(long n) {
	if (n == 0)
		return 1;
	else
		return n * myfatt(n);
}
</pre>
Solo una delle seguenti affermazioni &egrave; vera. Dire quale.

<ul>
<li><b>A</b> Il metodo non &egrave; ricorsivo, in quanto tutte le invocazioni avvengono con lo stesso valore del parametro di ingresso.
</li>
<li><b>B</b> Il metodo viene invocato ricorsivamente <tt>11</tt> volte.
</li>
<li><b>C</b> Non &egrave; possibile stabilire a priori se il metodo determini un&#x27;eccezione o meno, in quanto tale evento dipende dal valore di <tt>n</tt>.
</li>
<li><b>D</b> L&#x27;esecuzione del metodo causa un overflow dello stack della Java Virtual Machine in quanto determina un numero potenzialmente infinito di invocazioni ricorsive.
</li>
</ul>
<center><h3><b>Domanda 6</b></h3></center>
		Il minimo numero di foglie di un albero binario di n nodi &egrave;

<ul>
<li><b>A</b> 		&#x23A3;log<sub>2</sub> n&#x23A6;
</li>
<li><b>B</b> 		1
</li>
<li><b>C</b> 		n-1
</li>
<li><b>D</b> 		2<sup>n</sup>
</li>
</ul>
<center><h3><b>Domanda 7</b></h3></center>
	<domanda>
		Quale delle seguenti proposizioni &egrave; <b>falsa</b>?

<ul>
<li><b>A</b> 		n + log n &isin; O(log n)
</li>
<li><b>B</b> 		log (n<sup>10</sup>) &isin; O(log n)
</li>
<li><b>C</b> 		n log n &isin; &Omega;(n)
</li>
<li><b>D</b> 		n<sup>2</sup> &isin; O(n<sup>3</sup>)
</li>
</ul>
<center><h3><b>Domanda 8</b></h3></center>
	<domanda>
		Quale &egrave; la funzione principale che deve svolgere un router di una rete Internet

<ul>
<li><b>A</b> 		assegnare indirizzi IP ai terminali della rete Internet (Host)
</li>
<li><b>B</b> 		permettere la conversione di indirizzi IP mnemonici in numerici (es: www.uniroma1.it in 151.100.27.3)
</li>
<li><b>C</b> 		effettuare l&rsquo;indirizzamento dei pacchetti IP
</li>
<li><b>D</b> 		effettuare l&rsquo;istradamento dei pacchetti IP in rete
</li>
</ul>
<center><h3><b>Domanda 9</b></h3></center>
	<domanda>
Si consideri la seguente espressione booleana:
<tt>!(a || b) && b</tt>
Una sola delle seguenti affermazioni &egrave; vera. Quale?

<ul>
<li><b>A</b> l&#x27;espressione restituisce sempre true.
</li>
<li><b>B</b> l&#x27;espressione restituisce sempre false.
</li>
<li><b>C</b> l&#x27;espressione restituisce true solo quando b==true e a==false.
</li>
<li><b>D</b> l&#x27;espressione restituisce true solo quando b==true.
</li>
</ul>
<center><h3><b>Domanda 10</b></h3></center>
		Gli autovalori di un sistema ad anello chiuso coincidono con 

<ul>
<li><b>A</b> 		i poli della funzione di trasferimento ad anello chiuso pi&ugrave; eventuali autovalori nascosti;
</li>
<li><b>B</b> 		i poli della funzione di trasferimento ad anello aperto.
</li>
<li><b>C</b> 		i poli della funzione di trasferimento ad anello chiuso;
</li>
<li><b>D</b> 		i poli della funzione di trasferimento ad anello aperto pi&ugrave; eventuali autovalori nascosti;
</li>
</ul>
</body></html>
